app/controllers/answers_controller.rb

INSERT INTO `answers` (`ans_code`, `language`, `time_taken`, `remark`, `question_id`, `user_id`, `created_at`, `updated_at`) VALUES ('puts 1+1', 'ruby 2', 2, 'asfdasfd', 1, 2, '2021-04-19 18:25:51.613705', '2021-04-19 18:25:51.613705')
---
  def create

    @answer = @question.answers.new(answer_params)
    @answer.user_id = current_user.id

    respond_to do |format|
      if @answer.save

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
    def set_question
      @question = Question.find(params[:question_id])