app/controllers/questions_controller.rb

INSERT INTO `questions` (`title`, `description`, `level`, `time_taken`, `created_at`, `updated_at`) VALUES ('Python Program to Calculate the Area of a Triangle', 'to understand this example, you should have the knowledge of the following', 'easy', 2, '2021-04-19 09:23:25.421498', '2021-04-19 09:23:25.421498')
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save